onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИЛ_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.ИЛ_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИЛ_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИЛ. Добавляем на форму поле согласованной скидки.
	ИЛ_ДобавитьПолеСогласованнойСкидки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(
		ЭтотОбъект,
		Объект,
		ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// ИЛ. Обработчик изменения программно добавленного
// поля согласованной скидки.
&НаКлиенте
Процедура ИЛ_СогласованнаяСкидкаПриИзменении(Элемент)
	
	// ИЛ. Скидка в документе не может превышать 100 процентов.
	Если Объект.ИЛ_СогласованнаяСкидка > 100 Тогда
		
		Объект.ИЛ_СогласованнаяСкидка = 100;
		
		// ИЛ. Информируем пользователя о корректировке значения скидки.
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Согласованная скидка не может превышать 100 %. "
			+ "Установлено значение 100 %.";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	// ИЛ. Применяем согласованную скидку ко всем строкам
	// товаров и услуг и пересчитываем суммы.
	ИЛ_ПрименитьСогласованнуюСкидку();
	
КонецПроцедуры


// ИЛ. Применяет значение согласованной скидки
// ко всем строкам табличных частей документа.
&НаКлиенте
Процедура ИЛ_ПрименитьСогласованнуюСкидку()
	
	// ИЛ. Устанавливаем скидку для всех строк товаров.
	Для Каждого СтрокаТовара Из Объект.Товары Цикл
		
		СтрокаТовара.Скидка = Объект.ИЛ_СогласованнаяСкидка;
		
		// ИЛ. Используем существующий механизм расчета суммы строки.
		РассчитатьСуммуСтроки(СтрокаТовара);
		
	КонецЦикла;
	
	// ИЛ. Устанавливаем скидку для всех строк услуг.
	Для Каждого СтрокаУслуги Из Объект.Услуги Цикл
		
		СтрокаУслуги.Скидка = Объект.ИЛ_СогласованнаяСкидка;
		
		// ИЛ. Используем существующий механизм расчета суммы строки.
		РассчитатьСуммуСтроки(СтрокаУслуги);
		
	КонецЦикла;
	
	// ИЛ. После изменения строк пересчитываем общую сумму документа.
	РассчитатьСуммуДокумента();
	
КонецПроцедуры


// ИЛ. Программно добавляем поле согласованной скидки
// в правую часть шапки формы документа.
&НаСервере
Процедура ИЛ_ДобавитьПолеСогласованнойСкидки()
	
	// ИЛ. Создаем новый элемент формы.
	ЭлементСкидки = Элементы.Добавить(
		"ИЛ_СогласованнаяСкидка",
		Тип("ПолеФормы"),
		Элементы.ГруппаШапкаПраво);
	
	// ИЛ. Элемент используется как поле ввода.
	ЭлементСкидки.Вид = ВидПоляФормы.ПолеВвода;
	
	// ИЛ. Связываем элемент формы с реквизитом документа.
	ЭлементСкидки.ПутьКДанным =
		"Объект.ИЛ_СогласованнаяСкидка";
	
	// ИЛ. Устанавливаем заголовок поля.
	ЭлементСкидки.Заголовок =
		"Согласованная скидка";
	
	// ИЛ. Назначаем обработчик изменения значения скидки.
	ЭлементСкидки.УстановитьДействие(
		"ПриИзменении",
		"ИЛ_СогласованнаяСкидкаПриИзменении");
	
КонецПроцедуры


&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	ТекущиеДанные.Сумма =
		ТекущиеДанные.Цена
		* ТекущиеДанные.Количество
		* КоэффициентСкидки;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента =
		Объект.Товары.Итог("Сумма")
		+ Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры


#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(
		ЭтотОбъект,
		Команда,
		Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(
	ПараметрыВыполнения,
	ДополнительныеПараметры) Экспорт
	
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	
	ПодключаемыеКоманды.ВыполнитьКоманду(
		ЭтотОбъект,
		ПараметрыВыполнения,
		Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(
		ЭтотОбъект,
		Объект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
